/**
 * Зроблено:
 * Ім'я студента: Пушко Станіслав
 * Група студента: 121
 * Лабораторна 2.1
 */

#include <iostream>


int main()
{
    int arr[5][4] = 
          {{11,21,-3,4},
           {5,-6,0,8},
           {9,0,11,2},
           {4,-4,4,1},
           {0,1,-9,6} }; //створили двовимірний масив

    int arr1[4];

    for (int column = 0; column < 4; ++column) {
        for (int row = 0; row < 5; ++row) {
            if (arr[row][column] > 0) {
                arr1[column] *= arr[row][column]; // Із добутку додатних значень елементів стовпців двовимірного масиву
            }
        }
    }

    float arrF[4][5] = { {1.1, -2.0, -8.34, 5.5, 1.2},
                         {-0.2, 1.34, 2.2, -3.5, 1.1},
                         {-2.9, -3.1, 4.4, 7.2, -8.1},
                         {-2.6, -1.2, 3.4, 5.4, 6.6} }; //створили двовимірний масив

    
    
    for (int row = 0; row < 4; ++row) {
        float sum = 0;
        int count = 0;

        for (int col = 0; col < 5; ++col) {
            if (arrF[row][col] < 0) {
                sum += arrF[row][col];
                count++; 
            }




        }

        float avg = sum / count; // Із середнього арифметичного від’ємних значень елементів рядків двовимірного масиву

    }