/**
 * Зроблено:
 * Ім'я студента: Пушко Станіслав
 * Група студента: 121
 * Лабораторна 2.1
 */

#include <iostream>

int main()
{
   // Завдання 1
	int arr1[6];
	for (int i = 0; i < 6; i++)//перебираємо значення від 0 до 5 (6 не включно)
	{
		if (i % 2 == 0)//перевірка індекса і на парність
		{
			arr1[i] = 23 + i;
		}
		else //перевірка індекса і на непарність
		{
			arr1[i] = 25 - i;
		}
		

	}
	int size = 6;
	for (int i = 0; i < size - 1; i++)// визначаємо кількість проходів по масиву, для 6 елементів кількість проходів буде 5
	{
		for (int j = 0; j < size - i - 1; j++)// перебираємо елементи в масиві
		{
			if (arr1[j] > arr1[j + 1])//якщо лівий елемент більший за правий, то міняємо їх місцями
			{
				int temp = arr1[j];
				arr1[j] = arr1[j + 1];
				arr1[j + 1] = temp;
			}
		}
	}

		return 0;
}

