/**
 * Зроблено:
 * Ім'я студента: Пушко Станіслав
 * Група студента: 121
 * Лабораторна 2.3
 */

#include <iostream>

const int N = 8; // кількість елементів, що додаються до черги
const int M = 4;// кількість елементів, що видаляються з черги
const int size = 10; // максимальна кількість черги
struct Stack
{
	int data[size];//значення в векторному представленні заносяться до масиву
	int last = -1;// індекс останнього елемента в черзі
};
int main()
{
	Stack MyStack;// створення стеку
	int arr[size] = { 1,2,3,4,5,6,7,8,9,10 };//масив, з якого будуть заноситись елементи в чергу
	for (int i = 0; i < N && i < size; i++)//Запис елементів масиву в стек 
	{
		MyStack.data[i] = arr[i];
		MyStack.last++;
	}
	for (int i = 0; i < M && MyStack.last >= 0; i++)//видалення елементів зі стеку в кількості М (з кінця)
	{
		MyStack.data[MyStack.last] = MyStack.data[MyStack.last + 1];
		MyStack.last--;//індекс останнього елемента зменшується на 1 
	}
}

